{
    "version": "https://jsonfeed.org/version/1",
    "title": "Byte Marc",
    "description": "",
    "home_page_url": "https://marcgalbraith.com",
    "feed_url": "https://marcgalbraith.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Marc Galbraith"
    },
    "items": [
        {
            "id": "https://marcgalbraith.com/teams.html",
            "url": "https://marcgalbraith.com/teams.html",
            "title": "Teams",
            "summary": "Talent won’t save a team. A primary key factor that makes a team successful is psychological safety (See Google’s Project Aristotle). The way team members listen to each other and show sensitivity to each other feelings and needs. The question is how do you establish&hellip;",
            "content_html": "<p>Talent won’t save a team. A primary key factor that makes a team successful is psychological safety (<a href=\"https://rework.withgoogle.com/print/guides/5721312655835136/\">See Google’s Project Aristotle</a>). The way team members listen to each other and show sensitivity to each other feelings and needs. </p>\n<p>The question is how do you establish this critical social process to build the foundation of a team? It’s easy to say each team member needs to get along, or liked. Often the ideology of self-organising teams.</p>\n<p>Yet we all have varying degrees of social capability from our different experiences. Thus, teams are often our learning ground for developing social processes. These skills are best learnt seen in action and our actions held to account.</p>\n<p>There is a critical role that maintains this social consistency, a leader.</p>\n",
            "author": {
                "name": "Marc Galbraith"
            },
            "tags": [
            ],
            "date_published": "2020-10-17T15:21:00+11:00",
            "date_modified": "2021-06-17T15:31:23+10:00"
        },
        {
            "id": "https://marcgalbraith.com/the-agile-word.html",
            "url": "https://marcgalbraith.com/the-agile-word.html",
            "title": "Search Agile Word",
            "summary": "To be honest this google books chart bothers me, since the 1990s, including the word agile in books has been increasing. Some argue this is great news, a sign that it is popular and resonating. Or that it’s been a boon for self-publishing books with&hellip;",
            "content_html": "<p>To be honest this google books chart bothers me, since the 1990s, including the word agile in books has been increasing. Some argue this is great news, a sign that it is popular and resonating. Or that it’s been a boon for self-publishing books with the rise of the Internet.</p>\n<p>I’d argue this is a problem, a sign that the word is misunderstood and often redefined, leading to a lack of clarity. If my argument is true and you decide to make a significant organisational change based on this word. How successful do you think that would that be?</p>\n<p><figure class=\"post__image\"><img loading=\"lazy\" src=\"https://marcgalbraith.com/media/posts/3/1600734391527.jpeg\" sizes=\"(min-width: 1500px) calc(7.87vw + 610px), (min-width: 900px) calc(44.48vw + 68px), (min-width: 780px) calc(8vw + 604px), calc(84.35vw + 23px)\" srcset=\"https://marcgalbraith.com/media/posts/3/responsive/1600734391527-xs.jpeg 300w ,https://marcgalbraith.com/media/posts/3/responsive/1600734391527-sm.jpeg 480w ,https://marcgalbraith.com/media/posts/3/responsive/1600734391527-md.jpeg 768w\"  alt=\"Google Book Search Chart\" width=\"1536\" height=\"677\" /></figure></p>\n",
            "author": {
                "name": "Marc Galbraith"
            },
            "tags": [
            ],
            "date_published": "2020-09-17T15:12:00+10:00",
            "date_modified": "2021-06-17T15:30:20+10:00"
        },
        {
            "id": "https://marcgalbraith.com/dynamics-of-change.html",
            "url": "https://marcgalbraith.com/dynamics-of-change.html",
            "title": "Dynamics of Change",
            "summary": "Edgar H. Schein in his book Organizational Culture and Leadership, discusses the general stages of change within human systems such as groups and organisations, drawing from his consulting and research. Kurt Lewin wrote an article back in 1947 and concluded that for people and group&hellip;",
            "content_html": "<p>Edgar H. Schein in his book Organizational Culture and Leadership, discusses the general stages of change within human systems such as groups and organisations, drawing from his consulting and research. Kurt Lewin wrote an article back in 1947 and concluded that for people and group performance to change there appears to be three stages that they go through to establish new levels of performance:</p>\n<ol>\n<li>Unfreezing the current level.</li>\n<li>Moving to the new level.</li>\n<li>Freezing the new level.</li>\n</ol>\n<p>Edgar augmented this in the following manner (page 299):</p>\n<ol>\n<li>Unfreezing: Creating the motivation to change.</li>\n<li>Learning new concepts, new meanings for old concepts and new standards for judgement.</li>\n<li>Internalising new concepts, meanings and standards.</li>\n</ol>\n<p>While reflecting on these observations I started to think about the application of jobs-to-be-done theory, in particular the concept of progress making forces. It led me to ponder that the observations of people change and customer switching are closely related for they have one thing in common, being involved in a situation; the realisation that there is a problem causing motivation to be established.\nWhen a person decides to stop doing one thing and start doing another we call this a Switch in jobs-to-be-done language. Combining this thinking with Lewin/Edgar’s stages of change caused me to think that a customer appears to go through three distinct stages within a Switch:</p>\n<ol>\n<li>New situation arises in their life.</li>\n<li>Work towards resolving it, leveraging products and services</li>\n<li>Establish a new way.</li>\n</ol>\n<p>To navigate these stages we think of it within jobs-to-be-done as a set of forces. They can be broken into 4 distinct areas and have an impact on each other:</p>\n<ol>\n<li>Push of the situation.</li>\n<li>Attraction of the new.</li>\n<li>Anxiety of the new.</li>\n<li>Habit of the present.</li>\n</ol>\n<p>Forces 1 and 2 are progress generating (pushing forward) whilst 3 and 4 are resistive in nature (pulling back). Edgar Schein groups these forces in anxiety terms:</p>\n<ol>\n<li>Survival Anxiety - Must do something, learn what it is.</li>\n<li>Learning Anxiety - Unlearning something so it can be learned.</li>\n</ol>\n<p>My perception is that the progress generating forces in a Switch are the same components we can find in Survival Anxiety. In that for a person (customer) to survive they must actually learn something and likewise the resistive forces are akin to Learning Anxiety; the confrontation that a person will have to unlearn something. In social or group settings this threat is quite alarming.\nIt’s easy to learn new things when there is no unlearning and explains why it is easier when we are younger to learn as we simply have nothing to unlearn! We tend to find it hard to give up present habits, for those very habits are learned and must be unlearned if we are to make the Switch. Unlearning can generate a complex set of emotions which can cause all sorts of defence mechanisms to kick in.</p>\n<p>When studying the four forces through the perspective of jobs-to-be-done we learn that the progress generating forces always come with a side-effect; the more you focus on them the more resistive forces you potentially generate. It is as if you are stretching the customer further and further away from their old habits that has them unconsciously more and more concerned. Edgar Schein describes the same relationship between Survival and Learning Anxiety, outling two principles for transformative change aka Switching:</p>\n<p><strong>Principles</strong></p>\n<ol>\n<li>Survival anxiety (progress making forces) or guilt must be greater than learning anxiety.</li>\n<li>Learning anxiety (resistive forces) must be reduced rather than increasing survival anxiety.</li>\n</ol>\n<p>I believe these schools of thought overlap and blend nicely so I have created a hybrid diagram displaying the dynamics of change for a person which in turn is a customer.</p>\n<p><figure class=\"post__image\"><img loading=\"lazy\" src=\"https://marcgalbraith.com/media/posts/2/ForcesOfChange.png\" sizes=\"(min-width: 1500px) calc(7.87vw + 610px), (min-width: 900px) calc(44.48vw + 68px), (min-width: 780px) calc(8vw + 604px), calc(84.35vw + 23px)\" srcset=\"https://marcgalbraith.com/media/posts/2/responsive/ForcesOfChange-xs.png 300w ,https://marcgalbraith.com/media/posts/2/responsive/ForcesOfChange-sm.png 480w ,https://marcgalbraith.com/media/posts/2/responsive/ForcesOfChange-md.png 768w\"  alt=\"Forces of Change\" width=\"787\" height=\"506\" /></figure></p>\n",
            "author": {
                "name": "Marc Galbraith"
            },
            "tags": [
            ],
            "date_published": "2015-02-15T11:39:00+11:00",
            "date_modified": "2021-06-17T11:49:12+10:00"
        },
        {
            "id": "https://marcgalbraith.com/got-your-invitation.html",
            "url": "https://marcgalbraith.com/got-your-invitation.html",
            "title": "Got your invitation?",
            "summary": "In the consulting world, on a regular basis, I see what could be best described as lecturing. In particular my observations are that there’s a stronger presence of this behaviour in the technology sector; a silicon valley obsession. Organisations hire consultants for their expertise, they&hellip;",
            "content_html": "<p>In the consulting world, on a regular basis, I see what could be best described as lecturing. In particular my observations are that there’s a stronger presence of this behaviour in the technology sector; a silicon valley obsession. Organisations hire consultants for their expertise, they want help from them and not a lecture. As a consultant I’ll admit in my past I’ve fallen into this trap. And I put this down to bad theory.</p>\n<p>In the day to day of getting things done there are times when you happen to trip into an argument over a point, process, strategy, technique or idea. You don’t mean to come across this way, it’s just that you feel like you have something to bring to the table and don’t want to miss the opportunity. A feeling of confidence, quite rightly so, you think you’re the expert, been there before, you know what to do.</p>\n<p>But wait a moment, did you just notice the body language of the client. They’re showing little interest in you and what’s being said, defensive to your suggestions, they cut you off. So you try harder, get a little emotional about their lack of interest or position; maybe you think “Can’t they see what I see? Just do what I say?”</p>\n<p><strong>It’s a frustrating moment, so how could we avoid these types of situations?</strong></p>\n<p>A method I use is an invitational check, simply put I ask myself; “Do I have an invitation to talk through the advice I have in mind?” The invitation is a metaphor for trust and without it your advice is worthless. I’ve learnt this the hard way in my early days assuming that because the client hired me, surely they trust me already? In reality the client has only opened the door to building trust. Advice to a client is only valuable if it comes from a trustworthy source. To avoid the above scenario is to be conscious of your trust building methods and not how cool your advice is.</p>\n<p><strong>What does building trust look like?</strong></p>\n<p>They are many possibilities to what this would look like, context will be the determining factor. However a model I have found universal and independent of context is the <a href=\"http://www.amazon.com/The-Skilled-Helper-Problem-Management-Opportunity-Development/dp/1285065719\">Skilled Helper Egan Model</a></p>\n<p>In this model building trust is a focus on the problem and the connected opportunities seen by the client. It’s important that you empathise with what the client knows and feels about that knowledge; perspective is key. I’ve learnt that it helps, as a starting point, to get things out on the table, ask them about what they are seeing. </p>\n<p>It then opens the door for the client to talk about their stories in relation to the problem. Quite often story telling around the problem leads to new truths for the client as related stories pop up, your understanding and empathy to these stories will strengthen your relationship. As the stories emerge ask for situational specifics, thoughts, behaviours and emotions. Here you are seeking clarity, replaying what you understand and using the client’s language, remembering to stay in their world without correcting them; let their own words emerge onto the opportunity canvas.</p>\n<p>The more clarity in the story the easier it will be to identify the actions to take next. The “what to do next” is where you can ask great questions like “So what might be keeping you from doing what you want to do?” and “What options have you considered?”. I have found, surprisingly, these open helpful like questions will generate invitations for advice to get your expertise leveraged.</p>\n<p>Trust doesn’t happen overnight, but I would rather a client have my trust than risk appearing arrogant and unhelpful to their situation.</p>\n",
            "author": {
                "name": "Marc Galbraith"
            },
            "tags": [
            ],
            "date_published": "2014-04-29T10:34:00+10:00",
            "date_modified": "2021-06-17T11:33:36+10:00"
        }
    ]
}
